taskmanager/app/Filters/CheckBlockedIP.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $ip = $request->getIPAddress();
        $model = new IpMonitorModel();

        $row = $model->where('ip_address', $ip)->first();
---
SELECT *
FROM `ip_monitor`
WHERE `ip_address` = '192.168.10.8'
 LIMIT 1