taskmanager/app/Filters/IpBlockFilter.php

SELECT *
FROM `ip_monitor`
WHERE `ip_address` = '192.168.10.8'
AND `blocked` = 1
 LIMIT 1
---
    public function before(RequestInterface $request, $arguments = null)
    {
        $ip = $request->getIPAddress();
        $model = new IpMonitorModel();

        // Check if IP is blocked
        $blocked = $model->where('ip_address', $ip)
                         ->where('blocked', 1)
                         ->first();