taskmanager/app/Controllers/TaskController.php

    public function index()
    {
        if (!session()->get('user_logged_in')) {
            return redirect()->to('/admin/login')->with('error', 'Please log in.');
        }

        $role = session()->get('role');

        if ($role === 'admin') {
            $tasks = $this->getAllTasksWithAcceptances();
            $users = $this->userModel->where('role', 'user')->findAll() ?: [];
---
SELECT *
FROM `users`
WHERE `role` = 'user'

    public function getAllTasksWithAcceptances()
    {
        $query = $this->db->table('tasks')
            ->select('tasks.*, users.username as assigned_username')
            ->join('users', 'users.id = tasks.assigned_to', 'left')
            ->orderBy('tasks.status', 'ASC')
            ->orderBy('tasks.deadline', 'ASC')
            ->get();

        $tasks = $query->getResultArray();

        foreach ($tasks as &$task) {
            $acceptances = $this->db->table('task_acceptances')
                ->select('users.id, users.username')
                ->join('users', 'users.id = task_acceptances.user_id')
                ->where('task_acceptances.task_id', $task['id'])
                ->get()
                ->getResultArray();
---
SELECT `tasks`.*, `users`.`username` as `assigned_username`
FROM `tasks`
LEFT JOIN `users` ON `users`.`id` = `tasks`.`assigned_to`
ORDER BY `tasks`.`status` ASC, `tasks`.`deadline` ASC
SELECT `users`.`id`, `users`.`username`
FROM `task_acceptances`
JOIN `users` ON `users`.`id` = `task_acceptances`.`user_id`
WHERE `task_acceptances`.`task_id` = '25'